/* Задача 10: Напишите программу, которая принимает на вход 
трёхзначное число и на выходе показывает вторую цифру этого числа.

456 -> 5
782 -> 8
918 -> 1
*/

/*
int CutNum(int number)
{
    int result = (number/10) % 10;
    return result;
}

int randomNum = new Random().Next(100, 1000);
int resultNum = CutNum(randomNum);

Console.WriteLine($"новая версия числа {randomNum} следующая: {resultNum}");
*/
